# Задание 1. Треугольники.
#
# 1) Написать функцию create_randome_triangle() -> tuple, которая создает треугольник на плоскости со случайными
# координатами float (в диапазоне от -100.0 до 100.0 для каждой оси).
# функция дложна проверять, чтобы три точки не лежали на одной прямой.
# 3) Написать функцию create_right_triangle(vert:tuple) -> tuple, которая принимает координаты одной вершины и создает
# прямоугольный треугольник, площадь которого равна 100, с равными катетами параллельными осям координат.
# 2) написать функцию, которая считает площадь треугольника по координатем трех вершин.
#
import random

#1
def create_randome_triangle()-> tuple:
    triangle = ((23,-23),(int,)'A': 23, 213; 'B': 23,0)

    ((int, int), (int, int), (int, int))

    return triangle

print(create_randome_triangle())


во встором мы просто пишем A:(int,int)
и получаем ((A,(int,int)), (B,(int:int)), (C,(int:int)))
или словарем {'A': (int,int), 'B':(int,int), 'C': (int,int)}