[
  {
    "Автор": "Александр Сергеевич Грин",
    "Цитата": "Все, что изменяет нашу жизнь, — не случайность. Оно в нас самих и ждет лишь внешнего повода для выражения действием. ",
    "Link": "http://forismatic.com/ru/8fdd8ed724/"
  },
  {
    "Автор": "Альберт Эйнштейн",
    "Цитата": "Только те, кто предпринимает абсурдные попытки, смогут достичь невозможного. ",
    "Link": "http://forismatic.com/ru/ccd475393f/"
  },
  {
    "Автор": "Ани Чоинг Долма",
    "Цитата": "Люди принимают всё так серьезно, что это становится обузой для них. Учитесь больше смеяться. По мне, смех так же свят, как и молитва.",
    "Link": "http://forismatic.com/ru/42a63b9542/"
  },
  {
    "Автор": "Антуан де Сент-Экзюпери",
    "Цитата": "Если ты приручишь меня, мы будем нужны друг другу. Для меня ты станешь единственным во всём мире. И для тебя я стану единственным во всём мире. ",
    "Link": "http://forismatic.com/ru/865baad62e/"
  },
  {
    "Автор": "Бенедикт Спиноза",
    "Цитата": "Если вы хотите, чтобы жизнь улыбалась вам, подарите ей сначала свое хорошее настроение.",
    "Link": "http://forismatic.com/ru/d057782f8a/"
  },
  {
    "Автор": "Биллингс",
    "Цитата": "За деньги можно, конечно, купить очаровательного пса, но никакие деньги не смогут заставить его радостно вилять хвостом. ",
    "Link": "http://forismatic.com/ru/562bd19f8b/"
  },
  {
    "Автор": "Брайан Трейси",
    "Цитата": "Вы там, где вы есть, и тот, кто вы есть, потому что вы решили тут быть.",
    "Link": "http://forismatic.com/ru/ea76b4906a/"
  },
  {
    "Автор": "Брэд Дженсен",
    "Цитата": "Счастье останется недостижимым до тех пор, пока вы не изберете быть счастливыми сейчас. ",
    "Link": "http://forismatic.com/ru/295e2d4a6b/"
  },
  {
    "Автор": "Брюс Ли",
    "Цитата": "Даже самое крепкое дерево сломать проще, чем побеги бамбука или ивы, изгибающиеся на ветру. ",
    "Link": "http://forismatic.com/ru/d842a950e5/"
  },
  {
    "Автор": "Брюс Ли",
    "Цитата": "В бою всегда побеждает спонтанность. Зубрёжка всегда проигрывает. ",
    "Link": "http://forismatic.com/ru/1f3d8d6711/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Один день жизни обладающего кипучей энергией лучше столетнего существования ленивого и лишённого энергии человека. ",
    "Link": "http://forismatic.com/ru/d9b84df4f4/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Даже ливень из золотых монет не принесет удовлетворения страстям. Мудр тот, кто знает: страсти болезненны и мало от них радости. ",
    "Link": "http://forismatic.com/ru/3de49ac27a/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Пока зло не созреет, глупец считает его подобным мёду. Когда же зло созреет, тогда глупец предается горю. ",
    "Link": "http://forismatic.com/ru/cc0b4804c1/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Одно полустишие, услышав которое становятся спокойными, лучше тысячи стихов, составленных из бесполезных слов.",
    "Link": "http://forismatic.com/ru/122eb4f434/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Не привязывайся к приятному и никогда — к неприятному. Не видеть приятное и видеть неприятное — зло.",
    "Link": "http://forismatic.com/ru/0e0e743794/"
  },
  {
    "Автор": "Будда Гаутама",
    "Цитата": "Все, что мы собой представляем, создано нашими мыслями.",
    "Link": "http://forismatic.com/ru/9a75f4f7fb/"
  },
  {
    "Автор": "Буддийское учение",
    "Цитата": "Счастливы люди, если они ничего, кроме души своей, не называют своим. Счастливы они, если живут и среди корыстных, и злых, и ненавидящих их людей, — счастье их никто не может отнять от них.",
    "Link": "http://forismatic.com/ru/533b75d878/"
  },
  {
    "Автор": "Вергилий",
    "Цитата": "Они все могут, потому что уверены, что могут все. ",
    "Link": "http://forismatic.com/ru/7a84fd4f7f/"
  },
  {
    "Автор": "Винс Ломбарди",
    "Цитата": "Не важно, как часто вы падаете. Важно, как часто вы поднимаетесь. ",
    "Link": "http://forismatic.com/ru/f52424c5e1/"
  },
  {
    "Автор": "Генри Драммонд",
    "Цитата": "Если человек не предпринимает попытки сделать больше, чем он может, то ему никогда не удастся сделать все, на что он способен.",
    "Link": "http://forismatic.com/ru/002b958b08/"
  },
  {
    "Автор": "Генрих Гейне",
    "Цитата": "Величие мира всегда находится в соответствии с величием духа, смотрящего на него. Добрый находит здесь на земле свой рай, злой имеет уже здесь свой ад. ",
    "Link": "http://forismatic.com/ru/3a7403a94b/"
  },
  {
    "Автор": "Генрих Гейне ",
    "Цитата": "Для любви не существует вчера, любовь не думает о завтра. Она жадно тянется к нынешнему дню, но этот день нужен ей весь, неограниченный, не омраченный. ",
    "Link": "http://forismatic.com/ru/90499d3d22/"
  },
  {
    "Автор": "Гете",
    "Цитата": "Всякий обладает достаточной силой, чтобы исполнить то, в чем убежден. ",
    "Link": "http://forismatic.com/ru/cdbcabebe3/"
  },
  {
    "Автор": "Гораций",
    "Цитата": "Несчастье имеет свойство вызывать таланты, которые в счастливых обстоятельствах оставались бы спящими. ",
    "Link": "http://forismatic.com/ru/18cd0408a6/"
  },
  {
    "Автор": "Даррен Аронофски",
    "Цитата": "Я пытаюсь жить так, чтобы ни о чем не жалеть, я всегда выбираю ту дорогу, к которой меня толкает мое желание. Я иду за своей мечтой, а это — единственно верный путь.",
    "Link": "http://forismatic.com/ru/712e2e07ed/"
  },
  {
    "Автор": "Джордж Сантаяна",
    "Цитата": "Трудное — это то, что можно сделать сразу, невозможное — то, на что потребуется некоторое время. ",
    "Link": "http://forismatic.com/ru/a904b9006f/"
  },
  {
    "Автор": "Дипак Чопра",
    "Цитата": "Настоящий успех — это переживание чуда. Это ощущение чуда всюду, куда бы вы ни пошли, во всем, на что бы ни упал ваш взор — в глазах ребенка, в красоте цветка, в полете птицы. ",
    "Link": "http://forismatic.com/ru/a78fc86854/"
  },
  {
    "Автор": "Кавур",
    "Цитата": "Человек, доверяющий людям, совершает в жизни меньше ошибок, чем недоверяющий. ",
    "Link": "http://forismatic.com/ru/af3cf85d52/"
  },
  {
    "Автор": "Калвин Кулидж",
    "Цитата": "Я никогда не имел неприятностей из-за того, чего я не сказал. ",
    "Link": "http://forismatic.com/ru/b69225fa6b/"
  },
  {
    "Автор": "Карлос Кастанеда",
    "Цитата": "Люди, как правило, не отдают себе отчета в том, что в любой момент могут выбросить из своей жизни все что угодно. В любое время. Мгновенно. ",
    "Link": "http://forismatic.com/ru/2fbb180fd5/"
  },
  {
    "Автор": "Карлос Кастанеда",
    "Цитата": "Мир такой-то и такой-то только потому, что мы сказали себе, что он такой. ",
    "Link": "http://forismatic.com/ru/b768e5f8f4/"
  },
  {
    "Автор": "Карлос Кастанеда",
    "Цитата": "Сердиться на людей означает считать их поступки чем-то важным. Поступки людей не могут быть настолько важными, чтобы отвести на задний план единственную жизненно важную альтернативу: наши неизменные встречи с бесконечностью.",
    "Link": "http://forismatic.com/ru/ba54d11936/"
  },
  {
    "Автор": "Клод Адриан Гельвеций",
    "Цитата": "Мудрец более тверд и счастлив в беде, чем великие мира сего в роскоши и довольстве. ",
    "Link": "http://forismatic.com/ru/dcd9b9fef8/"
  },
  {
    "Автор": "Козьма Прутков",
    "Цитата": "Бросая в воду камешки, смотри на круги, ими образуемые: иначе такое бросание будет пустою забавой. ",
    "Link": "http://forismatic.com/ru/c16632a254/"
  },
  {
    "Автор": "Кришна",
    "Цитата": "Деревья отдают свои плоды и даже свою кору и листья и сок всем, кому они нужны. Хорошо тому человеку, который делает то же. Но мало есть людей, которые понимают это и поступают так.",
    "Link": "http://forismatic.com/ru/bbc025c60b/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Мы говорим, что идет время. Это неверно. Идем мы, а не время. Когда мы плывем по реке, нам кажется, что идут берега, а не лодка, на которой мы плывем. Так и время.",
    "Link": "http://forismatic.com/ru/db2621ca7a/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Если заботишься об одобрении людей, то никогда ни на что не решишься, потому что люди одобряют одни за одно, другие за другое. Надо самому решать. Оно и короче.",
    "Link": "http://forismatic.com/ru/fba1739812/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Только тогда человек понимает свою жизнь, когда он в каждом человеке видит себя.",
    "Link": "http://forismatic.com/ru/39dbc2e3ce/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Как только почувствуешь страсть, похоть, страх, злобу, вспомни, кто ты: вспомни, что ты не тело, а душа, и тотчас же затихнет то, что взволновало тебя.",
    "Link": "http://forismatic.com/ru/d638f10e47/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Чем больше людей верят в одно и то же, тем осторожнее надо быть к такой вере и тем внимательнее обсудить ее.",
    "Link": "http://forismatic.com/ru/ea72f446a8/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Исполняя свое внутреннее назначение, живя для души, человек невольно и самым действительным образом служит улучшению общественной жизни.",
    "Link": "http://forismatic.com/ru/711d35698d/"
  },
  {
    "Автор": "Лев Толстой",
    "Цитата": "Всякий раз, когда чего-нибудь очень хочется сделать, остановись и подумай: хорошо ли то, чего тебе так очень хочется.",
    "Link": "http://forismatic.com/ru/e5e092dc4f/"
  },
  {
    "Автор": "Макс Фрай",
    "Цитата": "В жизни каждого бывают моменты, когда следует броситься в пропасть, чтобы наконец убедиться в том, что всегда умел летать... ",
    "Link": "http://forismatic.com/ru/e1e3b4ed55/"
  },
  {
    "Автор": "Мао Цзэдун",
    "Цитата": "Если вы думаете, что сможете — вы сможете, если думаете, что нет — вы правы. ",
    "Link": "http://forismatic.com/ru/434a8de6a6/"
  },
  {
    "Автор": "Марк Аврелий ",
    "Цитата": "Если что-либо тебе не по силам, то не решай еще, что оно вообще невозможно для человека. Но если что-нибудь возможно для человека и свойственно ему, то считай, что оно доступно и тебе.",
    "Link": "http://forismatic.com/ru/631c0a782c/"
  },
  {
    "Автор": "Махатма Ганди",
    "Цитата": "Прощать более мужественно, чем наказывать. Слабый не может прощать. Прощение есть свойство сильного. ",
    "Link": "http://forismatic.com/ru/250c44c29e/"
  },
  {
    "Автор": "Мильфорд Прентис",
    "Цитата": "Господствующее настроение духа, угнетенное или честолюбивое, создает наши условия жизни, наш успех или неудачу. Поэтому никогда нельзя ставить пределов будущим возможностям. ",
    "Link": "http://forismatic.com/ru/08d949fd3c/"
  },
  {
    "Автор": "Мольер",
    "Цитата": "Любовь ревнивца более походит на ненависть. ",
    "Link": "http://forismatic.com/ru/92c0f5f0cb/"
  },
  {
    "Автор": "Морфеус, к/ф «Матрица»",
    "Цитата": "Ты можешь быстрее — предела нет. Знай, ты можешь — будь уверен. Хватит попыток — просто бей! ",
    "Link": "http://forismatic.com/ru/8e11d94b72/"
  },
  {
    "Автор": "Наполеон Бонапарт",
    "Цитата": "Гениальные люди — это метеоры, призванные сгореть, чтобы озарить свой век. ",
    "Link": "http://forismatic.com/ru/54d1432d0d/"
  },
  {
    "Автор": "Николай Амосов",
    "Цитата": "Внешняя свобода не всегда дает свободу внутреннюю. Только внутренне свободный человек способен воспринимать новое.",
    "Link": "http://forismatic.com/ru/f2073ff686/"
  },
  {
    "Автор": "Никос Казантцакис",
    "Цитата": "До тех пор, пока ты не порвешь со старым, ты не сможешь жить по-настоящему.",
    "Link": "http://forismatic.com/ru/7d2b1e4b81/"
  },
  {
    "Автор": "Норман Пил ",
    "Цитата": "Во что ты веришь, того и достигнешь.",
    "Link": "http://forismatic.com/ru/f0ca614808/"
  },
  {
    "Автор": "Олдос Леонард Хаксли",
    "Цитата": "Существует только один уголок вселенной, который вы можете улучшать с уверенностью, это вы сами.",
    "Link": "http://forismatic.com/ru/e266c57477/"
  },
  {
    "Автор": "Олдос Хаксли",
    "Цитата": "Опыт — это не то, что происходит с человеком, а то, что делает человек с тем, что с ним происходит. ",
    "Link": "http://forismatic.com/ru/ed5b7b8a53/"
  },
  {
    "Автор": "Оскар Уайльд",
    "Цитата": "Мужчина может быть счастлив с любой женщиной, кроме той, в которую он влюблен. ",
    "Link": "http://forismatic.com/ru/3dd4799e0d/"
  },
  {
    "Автор": "Оскар Уайльд",
    "Цитата": "Идея, которая не кажется опасной, и не идея вовсе!",
    "Link": "http://forismatic.com/ru/d1aaaa0c6b/"
  },
  {
    "Автор": "Оскар Уайльд",
    "Цитата": "О чем не говоришь, того как будто не было. Только слова придают реальность явлениям.",
    "Link": "http://forismatic.com/ru/29c61973aa/"
  },
  {
    "Автор": "Оскар Уайльд",
    "Цитата": "Самая обыкновенная безделица приобретает удивительный интерес, как только начинаешь скрывать ее от людей.",
    "Link": "http://forismatic.com/ru/feb02fa799/"
  },
  {
    "Автор": "Паоло Коэльо",
    "Цитата": "Если ты чего-нибудь хочешь, вся Вселенная будет способствовать тому, чтобы желание твое сбылось. ",
    "Link": "http://forismatic.com/ru/13e7cad1ea/"
  },
  {
    "Автор": "Пауло Коэльо",
    "Цитата": "Чудесам случаться позволяет желание верить, что жизнь есть чудо. ",
    "Link": "http://forismatic.com/ru/b6fdbe1173/"
  },
  {
    "Автор": "Пауло Коэльо",
    "Цитата": "Воин света внимательно вглядывается в детские глаза, ибо им дано видеть мир, лишённый горечи. Когда воин света хочет узнать, достоин ли доверия тот, кто рядом с ним, он старается увидеть его глазами ребёнка. ",
    "Link": "http://forismatic.com/ru/88a330234c/"
  },
  {
    "Автор": "Питер Шульц",
    "Цитата": "Когда ничего не меняется, вперед выбивается посредственность. ",
    "Link": "http://forismatic.com/ru/7d57adc74f/"
  },
  {
    "Автор": "Пифагор Самосский",
    "Цитата": "Старайся прежде быть мудрым, а ученым — когда будешь иметь свободное время. ",
    "Link": "http://forismatic.com/ru/0c2f901a34/"
  },
  {
    "Автор": "Публий Вергилий Марон",
    "Цитата": "Смелым помогает судьба. ",
    "Link": "http://forismatic.com/ru/b593ab0662/"
  },
  {
    "Автор": "Ралф Эмерсон",
    "Цитата": "Каждый человек, которого я встречаю, меня в чем-то превосходит, и в этом смысле я могу у него поучиться.",
    "Link": "http://forismatic.com/ru/8e02136b3f/"
  },
  {
    "Автор": "Ричард Бах",
    "Цитата": "Для того чтобы стать свободным и счастливым, ты должен пожертвовать скукой. Не всегда такую жертву принести легко.",
    "Link": "http://forismatic.com/ru/180754dee9/"
  },
  {
    "Автор": "Ричард Брэнсон",
    "Цитата": "Жизнь коротка, чтобы тратить ее на вещи, которые не приносят удовольствия. Если есть голова на плечах и достаточно задора в сердце, любая цель будет по силам. Если что-то нравится — делай. Не нравится — бросай не раздумывая. ",
    "Link": "http://forismatic.com/ru/fd76db4a22/"
  },
  {
    "Автор": "Робин Шарма",
    "Цитата": "Творчество приходит тогда, когда вы расслаблены, счастливы и наслаждаетесь настоящим. ",
    "Link": "http://forismatic.com/ru/5686bcc746/"
  },
  {
    "Автор": "Робин Шарма",
    "Цитата": "Каждый день жизни посылает вам небольшие окошки в «возможность». В конечном счете вся ваша судьба будет зависеть от вашей реакции на такие моменты. ",
    "Link": "http://forismatic.com/ru/9771beb389/"
  },
  {
    "Автор": "Робин Шарма",
    "Цитата": "Если вы хотите стать более счастливым, делайте больше таких вещей, которые делают вас счастливым. ",
    "Link": "http://forismatic.com/ru/71936e29f7/"
  },
  {
    "Автор": "Руми",
    "Цитата": "Ты более драгоценен, чем небо и земля, ты сам себе цены не знаешь.",
    "Link": "http://forismatic.com/ru/8ce56b7dd1/"
  },
  {
    "Автор": "Саади",
    "Цитата": "Тот, кто дает упрямцу совет, сам нуждается в совете. ",
    "Link": "http://forismatic.com/ru/be041c52da/"
  },
  {
    "Автор": "Самюэл Батлер",
    "Цитата": "Единственное, к чему стоит относиться серьезно, так это то, что ни к чему нельзя относиться серьезно.",
    "Link": "http://forismatic.com/ru/d9d9f6763c/"
  },
  {
    "Автор": "Свами Анантананда",
    "Цитата": "Все мелкие и крупные проблемы нашей жизни в конечном счёте сводятся к одной-единственной великой проблеме: незнанию себя.",
    "Link": "http://forismatic.com/ru/270c348dcc/"
  },
  {
    "Автор": "Солон",
    "Цитата": "О тайном догадывайся по явному.",
    "Link": "http://forismatic.com/ru/df932f8e2c/"
  },
  {
    "Автор": "Софья Сегюр",
    "Цитата": "Мужчины говорят о женщинах все, что им нравится, а женщины делают из мужчин все, что им хочется. ",
    "Link": "http://forismatic.com/ru/3dca569ef5/"
  },
  {
    "Автор": "Станислав Ежи Лец",
    "Цитата": "Часто одной только смелости мало, нужна еще на­глость. ",
    "Link": "http://forismatic.com/ru/017baf4a1e/"
  },
  {
    "Автор": "Стивен Райт",
    "Цитата": "Нельзя иметь все. Куда вы все это положите? ",
    "Link": "http://forismatic.com/ru/17c4d2004c/"
  },
  {
    "Автор": "Сюнь Цзы",
    "Цитата": "Породистый скакун одним прыжком не сможет покрыть расстояния в тысячу ли. На кляче можно преодолеть это расстояние за десять дней, если не останавливаться на полпути.",
    "Link": "http://forismatic.com/ru/8f8e88f02c/"
  },
  {
    "Автор": "Теренций",
    "Цитата": "Сколько людей, столько и мнений.",
    "Link": "http://forismatic.com/ru/979879c6c8/"
  },
  {
    "Автор": "Томас Карлейль",
    "Цитата": "В тебе знание того, в чем высшее совершенство. В тебе же и препятствия к достижению его. Твое положение — это то самое, над чем ты должен работать, чтобы приблизиться к совершенству.",
    "Link": "http://forismatic.com/ru/374beb7299/"
  },
  {
    "Автор": "Фрэнк Уитни",
    "Цитата": "Всякий раз когда человек добивается успеха, его последующее достижение становится более легким. Он начинает мыслить категориями успеха и двигаться к большему успеху. ",
    "Link": "http://forismatic.com/ru/0aa81a494f/"
  },
  {
    "Автор": "Хун Цзычен",
    "Цитата": "Из неудачи нередко можно извлечь полезный урок, поэтому промахи — лучшее подспорье делу ",
    "Link": "http://forismatic.com/ru/0ca7c38e4d/"
  },
  {
    "Автор": "Хун Цзычен",
    "Цитата": "Тот, кто предан учению, должен в самом себе почтить движущую силу Неба и душою стать, как чистая яшма, дабы сердцем откликаться каждому существу.",
    "Link": "http://forismatic.com/ru/efe052189b/"
  },
  {
    "Автор": "Чак Норрис",
    "Цитата": "Удерживайте фокус внимания на том, что происходит здесь и сейчас, и тогда вы будете сохранять контроль над собой. ",
    "Link": "http://forismatic.com/ru/4b9d45df6f/"
  },
  {
    "Автор": "Чжуан Цзы",
    "Цитата": "Тот, кто полагается на оружие гибнет. ",
    "Link": "http://forismatic.com/ru/89ff5b9683/"
  },
  {
    "Автор": "Шакти Гавэйн",
    "Цитата": "Мы вносим вклад в этот мир уже тем, что в каждое мгновение являемся самими собой. ",
    "Link": "http://forismatic.com/ru/26124dc828/"
  },
  {
    "Автор": "Шри Ауробиндо",
    "Цитата": "Трагедии сердца и тела — это плач детей из-за мелких бед и сломанных игрушек. Улыбнись про себя, но утешь детей, и прими участие, если можешь, в их игре. ",
    "Link": "http://forismatic.com/ru/2578c347e6/"
  },
  {
    "Автор": "Шри Ауробиндо",
    "Цитата": "Бог любит в нужный момент свалять дурака. Человек же делает это и вовремя, и невовремя. В этом вся разница. ",
    "Link": "http://forismatic.com/ru/25d1c62acf/"
  },
  {
    "Автор": "Шри Ауробиндо",
    "Цитата": "Если пред тобою великая цель, а возможности твои ограничены, все равно действуй. Ибо только через действие могут возрасти твои возможности.",
    "Link": "http://forismatic.com/ru/838b683806/"
  },
  {
    "Автор": "Шри Ауробиндо",
    "Цитата": "Своей движущей силой мир полагает свет разума, в действительности же его приводят в движение собственные вера и интуиция. ",
    "Link": "http://forismatic.com/ru/3057eb658e/"
  },
  {
    "Автор": "Эдуард Де Боно",
    "Цитата": "Совершенствуя дилижанс, можно создать совершенный дилижанс; но первоклассный автомобиль — едва ли. ",
    "Link": "http://forismatic.com/ru/35ce310b6b/"
  },
  {
    "Автор": "Эзоп",
    "Цитата": "Лаской почти всегда добьешься больше, чем грубой силой. ",
    "Link": "http://forismatic.com/ru/e2245c1655/"
  },
  {
    "Автор": "Эпиктет",
    "Цитата": "Люди, презирающие тебя за твою кротость, ничего не понимают в том, что добро для человека. Так что же тебе за дело до их суждений?",
    "Link": "http://forismatic.com/ru/34212921f4/"
  },
  {
    "Автор": "Эрих Мария Ремарк",
    "Цитата": "Никогда не следует мельчить то, что начал делать с размахом. ",
    "Link": "http://forismatic.com/ru/6fcd98c6ea/"
  },
  {
    "Автор": "Эрих Мария Ремарк",
    "Цитата": "Кто слишком часто оглядывается назад, легко может споткнуться и упасть.",
    "Link": "http://forismatic.com/ru/7a68701d1b/"
  },
  {
    "Автор": "Ювенал",
    "Цитата": "Спор никого не убеждает, а разъединяет и озлобляет. Что молоток для гвоздей, то спор для мнений людей. Мнения, еще шаткие, после споров становятся так же твердо забиты в головы, как гвозди до шляпок.",
    "Link": "http://forismatic.com/ru/8b99601679/"
  },
  {
    "Автор": "Ян Коменский",
    "Цитата": "Хочешь быть спокойным? Не рассеивайся многими вещами, не занимайся ненужными делами, не поддавайся гневу.",
    "Link": "http://forismatic.com/ru/432ad3a5f4/"
  },
  {
    "Автор": "к/ф «Форрест Гамп»",
    "Цитата": "Жизнь — как коробка конфет, никогда не знаешь, что вытащишь.",
    "Link": "http://forismatic.com/ru/0aa56cfd26/"
  }
]